# GetMaterialByGUID Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationConfiguration..::..GetMaterialByGUID Method
FabricationConfiguration Class See Also
---
Gets the material identifier by its GUID.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public int GetMaterialByGUID(
	Guid materialGUID
)
```

Visual Basic
---
```text
Public Function GetMaterialByGUID ( _
	materialGUID As Guid _
) As Integer
```

Visual C++
---
```text
public:
int GetMaterialByGUID(
	Guid materialGUID
)
```

# ### Parameters
materialGUID
    Type: System..::..Guid The material GUID.
# ### Return Value
The material identifier. Returns 0 if not found.
# See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace